app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Lorem ipsum dolor sit amet."], ["updated_at", "2021-03-14 18:57:56.530674"], ["id", 6]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)